Revit 2024 API
BuiltInFailures.AssemblyFailures.AssemblyNewTypeWarn Property
 Edits to these assemblies match existing type and will inherit that name.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId AssemblyNewTypeWarn { get; }
Visual Basic
Public Shared ReadOnly Property AssemblyNewTypeWarn As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ AssemblyNewTypeWarn {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.AssemblyFailures Class
Autodesk.Revit.DB Namespace